In [37]:
import numpy as np 
import pandas as pd 

df = pd.read_csv('titanic.csv')

In [24]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
c_pass = df[df['Embarked'] == 'C']

In [26]:
num_c = len(c_pass)
num_c

168

In [27]:
len(df)

891

In [28]:
# percent of passengers who Embarked from C
percent_of_passengers_in_c = (num_c)/len(df)
percent_of_passengers_in_c

0.18855218855218855

In [29]:
females = df[df['Sex'] == 'female']

In [30]:
len(females)

314

In [31]:
females_in_c = df[(df['Sex'] == 'female') & (df['Embarked'] == 'C')]

In [32]:
# Percentage of female passengers who embarked from C
len(females_in_c) / len(females)

0.23248407643312102

In [33]:
# Solve it another way!
pd.crosstab(df['Sex'], df['Embarked'])

Embarked   C   Q    S
Sex
female    73  36  203
male      95  41  441

In [34]:
pd.melt(df['Sex'])

AttributeError: 'Series' object has no attribute 'columns'

In [35]:
df.all()

PassengerId     True
Survived       False
Pclass          True
Name            True
Sex             True
Age             True
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [44]:
# all females who have a value for Embarkation
s = 0
for embarked_type in df['Embarked'].dropna().unique():
    s += len(df[(df['Embarked'] == embarked_type) & (df['Sex'] == 'female')])
    
s

312

In [40]:
# data cleaning here
df[df['Embarked'].notnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
df[df['Embarked']]